# 2) კომენტარებით ახსენით რა არის loop(ციკლი)

# ციკლი (loop) — პროგრამირების სტრუქტურაა,
# რომელიც ერთი და იგივე ბრძანებებს მრავალჯერ ასრულებს,
# სანამ განსაზღვრული პირობა არ დასრულდება.
# for ციკლი იწყებს გამრავლებას კოლექციის (მაგ.: range) თითოეულ ელემენტზე.


# 3) კომენტარებით ახსენით რა არის range ფუნქცია და დეტალურად ისაუბრეთ მასზე(განიხილეთ არგუმენტების გადაცემის ყველა ვარიანტი)

# range — პმართველი (built-in) ფუნქცია, რომელიც ქმნის უცვლელ (immutable) 
# რიცხვების შეკრებას (range object). ეს ობიექტი არ აღჭურვავს ყველა ელემენტს 
# მეხსიერებაში — იგი "ლაზიურად" წარმოადგენს არტივებს და ამიტომ გონივრულად
# ეფექტურია დიდ თანმიმდევრობებთან მუშაობისთვის.

# სინდაქსიები (ყველა არგუმენტი უნდა იყოს მთელი რიცხვი):
#   range(stop)
#   range(start, stop)
#   range(start, stop, step)

# 1) range(stop)
#   - ფუნქცია იწყებს 0–დან და მიდის stop-ამდე, მაგრამ stop არ შედის (exclusive).
#   - მაგალითად range(5) ქმნის: 0, 1, 2, 3, 4

# 2) range(start, stop)
#   - იწყებს start-დან და მიდის stop-ისკენ (stop ისევ არ შედის).
#   - მაგალითად range(3, 7) => 3, 4, 5, 6

# 3) range(start, stop, step)
#   - step = თითო ნაბიჯის ზომა; შეიძლება იყოს დადებითი ან უარყოფითი.
#   - step–ის ნაგულისხმევი მნიშვნელობა, თუ არგუმენტი არ არის მოცემული, არის 1.
#   - მაგალითები:


# პრაქტიკული წესი:
#  - გამოიყენეთ range, როცა გჭირდებათ რიცხვითი ინდექსები for ციკლში:
# დაბოლოება: range არის მარტივი, სწრაფი და მეხსიერების ეფექტური გზა მთლიან რიცხვებთან
# გამოტრიალებისა და ინდექსირებისთვის. აიფუნქციების (stop,start,step) კომბინაციებით
# შეგიძლიათ შექმნათ ზრდადი და კლებადი თანმიმდევრობები, ასევე სხვა განსაკუთრებული შრედები.


# 4) დაბეჭდეთ 100-დან 200-ის ჩათვლით ყველა რიცხვი
for i in range(100, 201):  
    print(i)

# 5) დაბეჭდეთ 20-დან 30-მდე ყოველი მესამე რიცხვი 
for i in range(20, 31, 3):
    print(i)

# 6) დაბეჭდეთ 0-დან 20-ის ჩათვლით ყველა ლუწი რიცხვი
for i in range(0, 21, 2):
    print(i)


 # 7) მოითხოვეთ 5 რიცხვი და დაბეჭდეთ მათი საშუალო არითმეტიკული

total = 0 

for _ in range(5):          
    num = float(input())   
    total = num            

average = total / 5        
print(average)
