# 2) კომენტარებით ახსენით რა არის sequencing iteration და selection. მოიყვანეთ მათი მაგალითები.

# Sequencing (მიმდევრობა)
# ეს არის პროგრამის ბრძანებების შესრულება ზუსტად იმ რიგით, როგორც დაწერილია. ყოველი ინსტრუქცია სრულდება ერთის შემდეგ მეორე, ზედიზედ.

# print("Hello")
# x = 5 + 3
# print(x)
# → ჯერ იბეჭდება “Hello”, შემდეგ სრულდება გამოთვლა და ბოლოს იბეჭდება შედეგი.

# Selection (არჩევა)
# ეს არის გადაწყვეტილების მიღება პირობების მიხედვით — პროგრამა ირჩევს რომელ ბლოკს შეასრულოს.

# x = 10
# if x > 5:
#     print("დიდია")
# else:
#     print("პატარაა")
# → შეასრულებს მხოლოდ ერთ ბლოკს, დამოკიდებულია პირობაზე.

# Iteration (იტერაცია / გამეორება)
# ეს ნიშნავს ბრძანებების განმეორებით შესრულებას მანამ, სანამ პირობა ჭეშმარიტია.
# მაგალითი:

# for i in range(3):
#     print(i)
# → იბეჭდება მესამედ, რადგან ციკლი სამჯერ ტრიალებს.

# 3) კომენტარებით ახსენით რა არის ალგორითმი და მოიყვანეთ მისი მაგალითები
# ალგორითმი — ეს არის ზუსტად განსაზღვრული ნაბიჯების (ბრძანებების) თანმიმდევრობა, რომელიც რაიმე ამოცანის ამოხსნას უზრუნველყოფს. ყოველი ნაბიჯი უნდა იყოს ცალსახად გასაგები და დასასრულებელი.

#ორი რიცხვის ჯამის გამოთვლა:

# ვკითხავთ ორ რიცხვს
a = int(input("შეიყვანე პირველი რიცხვი: "))
b = int(input("შეიყვანე მეორე რიცხვი: "))

# ვიპოვოთ ჯამი
sum = a + b

# დავბეჭდოთ შედეგი
print("ჯამი =", sum)

#5) შექმენით მარტივი პროგრამა, რომელიც მომხმარებელს შემოატანინებს სახელს, თუ ის ემთხვევა თქვენსას დაბეჭდავს True-ს, სხვა შემთხვევაში False-ს.
#ახსენით ამ პროგრამის/ალგორითმის მუშაობა თქვენთვის ცნობილი სამი გზიდან ერთ-ერთით(flowchart, pseudocode, natural language)

# მომხმარებლისგან სახელის მიღება
name = input("შეიყვანე შენი სახელი: ")

# შემოწმება ემთხვევა თუ არა ჩემს სახელს
if name == "Saba":
    print(True)
else:
    print(False)


# START  
# INPUT name  
# IF name = "Saba" THEN  
#     OUTPUT True  
# ELSE  
#     OUTPUT False  
# END IF  
# END
