#  2) გაყოფის ტიპები Python-ში

#  /  — ჩვეულებრივი გაყოფა
#  აბრუნებს ათწილად რიცხვს, მიუხედავად იმისა იყოფა თუ არა ზუსტად
# print(10 / 2)   # 5.0
# print(7 / 2)    # 3.5
# print(9 / 4)    # 2.25

#  // — მთლიანი გაყოფა
#  აბრუნებს მხოლოდ მთელ ნაწილს (დაბლა დამრგვალებით)
# print(10 // 2)  # 5
# print(7 // 2)   # 3
# print(9 // 4)   # 2

#  % — ნაშთის პოვნა
# აბრუნებს გაყოფის შემდეგ დარჩენილ ნაშთს
# print(10 % 2)   # 0
# print(7 % 2)    # 1
# print(9 % 4)    # 1


#  3) elif
#  elif ნიშნავს "else if"
#  გამოიყენება მაშინ, როცა რამდენიმე პირობის შემოწმება გვჭირდება
#  ის ამოწმებს ახალ პირობას, თუ წინა if პირობა არ შესრულდა

# age = 15

# if age < 13:
#     print("ბავშვი")
# elif age < 18:
#     print("მოზარდი")
# else:
#     print("ზრდასრული")


# 4) ნაკიანი წლის პროგრამა
# წელი არის ნაკიანი თუ:
# - იყოფა 4-ზე და არ იყოფა 100-ზე
# ან
# - იყოფა 400-ზე

year = int(input("შეიყვანეთ წელი: "))

if (year % 4 == 0 and year % 100 != 0) or (year % 400 == 0):
    print("ეს წელი ნაკიანია")
else:
    print("ეს წელი არ არის ნაკიანი")
