# 2) დაწერეთ პროგრამა, რომელიც მომხმარებელს შემოატანინებს რიცხვს, და დაბეჭდავს 1-დან შემოტანილი რიცხვის ჩათვლით ყველა რიცხვის ნამრავლს(ფაქტორიალს)
n = int(input("შეიყვანეთ რიცხვი: "))

factorial = 1
for i in range(1, n + 1):
    factorial *= i

print("ფაქტორიალი =", factorial)
#=================================================================================================================================================================================
# 3) მოიძიეთ ინფორმაცია % გაყოფის შესახებ, ახსენით კომენტარებით თუ რაში გვეხმარება ის და გააკეთეთ მაგალითები
# % (მოდულო) ოპერაციის ახსნა

# % აბრუნებს ნაშთს ორი რიცხვის გაყოფის შედეგად.
# მაგ:
# 17 % 5 → 17 გაყოფილია 5-ზე, ნაშთი არის 2, ამიტომ შედეგი: 2.

# სად გამოიყენება %

# ლუწი/კენტი რიცხვის განსაზღვრა
# x % 2 == 0 → ლუწი
# x % 2 == 1 → კენტი

# ციფრების ამოღება რიცხვიდან
# n % 10 → რიცხვის ბოლო ციფრი

# ციკლური გამოთვლები (მაგ., კვირის დღეები)
# day % 7

# დროის გარდაქმნა
# minutes % 60 → დარჩენილი წუთები

# ლუწი/კენტი რიცხვის შემოწმება
num = 11
if num % 2 == 0:
    print("ლუწია")
else:
    print("კენტია")
#=================================================================================================================================================================================
#4) მომხმარებელს შემოატანინეთ რიცხვი და დაბეჭდეთ შემოტანილი რიცხვიდან ყველა გამყოფი, ანუ ისეთი რიცხვები რომლებზეც შემოტანილი რიცხვი უნაშთოდ იყოფა
n = int(input("შეიყვანეთ რიცხვი: "))

for i in range(1, n + 1):
    if n % i == 0:     # თუ ნაშთი 0-ია, გამყოფია
        print(i)
