#1 შექმენით ცვლადი, შეუცვალეთ მას მნიშვნელობა 3-ჯერ. თითოეული მნიშვნელობის შეცვლის შემდეგ დაბეჭდეთ ეს ცვლადი.
age=14
age=15
age=16
print(age)


#2 შექმენით 5 ცვლადი, სადაც შეინახავთ რიცხვებს. დაბეჭდეთ მათი ჯამი print ფუნქციის გამოყენებით.
age1=14
age2=32
age3=43
age4=98
age5=65
print(age1+age2+age3+age4+age5)

#3 მართკუთხედის პერიმეტრი:
# შექმენით ორი ცვლადი length და width(მართკუთხედის გვერდები), მიანიჭეთ მნიშვნელობებად 20 და 10. გამოითვალეთ მართკუთხედის პერიმეტრი და დაბეჭდეთ.
lenght=20
widht=10
print(lenght+widht+lenght+widht)