#2) კოემნტარებით ახსენით რა არის "კომენტარი", როგორ უნდა შევქმნათ ის პითონში
# კომენტარი არის ტექსტი, რომელსაც პროგრამა არ ასრულებს. მას ვიყენებთ იმისათვის, რომ ავხსნათ, რას აკეთებს კოდი. Python-ში კომენტარი იწყება "#" ნიშნით.


#3) კომენტარებით ახსენით რა არის ქეის სენსიტიურობა და მოიყვანეთ რამოდენიმე მაგალითი
# Case Sensitivity (მგრძნობელობა ასოების რეგისტრის მიმართ)Python-ში დიდი და პატარა ასოები განსხვავებულია. მაგალითად, ცვლადები "name", "Name" და "NAME" სამი განსხვავებული ცვლადია.

name = "Gio"
Name = "Nika"
NAME = "Luka"

print(name)  
print(Name)  
print(NAME) 

#4) კომენტარებით ახსენით რა არის snake_case-ი და შექმენით მისი გამოყენებით რამოდენიმე ცვლადი 
# 4) snake_case არის წერის სტილი, სადაც სიტყვებს შორის ქვედატირე (_) იწერება. 
user_name = "Giorgi"
user_age = 15
favorite_color = "Blue"

print(user_name, user_age, favorite_color)

#5) კომენტარებით ახსენით რა არის debugging-ი.
# Debugging ნიშნავს შეცდომების (bug-ების) პოვნასა და გამოსწორებას პროგრამაში.
# დეველოპერები კოდს ამოწმებენ, პოულობენ შეცდომას და ასწორებენ მას.



#გამოასწორეთ შეცდომები შემდეგ კოდში:
#სწორი უბრალოდ ""აკლდა
print("Hello World")    
city="London"
print("City")