
def gamravleba(a, b):
    return a * b  

result = gamravleba(4, 5)


print(result)



# print:
# - უბრალოდ ბეჭდავს მნიშვნელობას ეკრანზე
# - არ აბრუნებს მნიშვნელობას ფუნქციიდან
# - მისი შედეგი ვერ შეინახება ცვლადში

# return:
# - აბრუნებს მნიშვნელობას ფუნქციიდან
# - ფუნქციის მუშაობა return-ის შემდეგ მაშინვე წყდება
# - დაბრუნებული მნიშვნელობა შეიძლება შევინახოთ ცვლადში და გამოვიყენოთ პროგრამის სხვა ნაწილში

# return keyword-ის დეტალური ახსნა: return გამოიყენება ფუნქციაში იმისთვის, რომ შედეგი "დაუბრუნოს" იმ ადგილს,
# საიდანაც ფუნქცია გამოიძახეს. return-ის გარეშე ფუნქცია ვერ დააბრუნებს შედეგს და ავტომატურად დააბრუნებს None-ს.
