#1 კომენტარებით ახსენით რა არის print-ი და რატომ ვიყენებთ ბრჩხილებს მისი წერისას
#პრინტის საშვალებით ჩვენ შეგვიძლია შედეგი ვნახოთ ტერმინალში. ფრჩხილებს ვიყენებთ იმიტომ რომ ჩავწეროთ მნიშვნელობა.
#2 შექმენით ცვლადი, სადაც შეინახავთ თქვენს სახელს, შემდეგ კი დაბეჭდეთ ეგ ცვლადი

name="saba"
print(name)
#3 კომენტარებით ახსენით რა არის დეკლარაცია.
#დეკლარაცია პითონში ნიშნავს განცხადებას როცა რაღაცას ვქმნით და ვებუბნებით პროგრამას რომ ეს არსებობს.
#4 შექმენით ცვლადი სახელად number და გაუტოლეთ ის 10-ს, შემდეგ დაბეჭდეთ ამ ცვლადის მნიშვნელობა print ფუნქციის გამოყენებით. შემდეგ დაწერეთ იგივე ცვლადი და გაუტოლეთ იგი 20-ს. საბოლოოდ ხელახლა დაბეჭდეთ number ცვლადი და თქვენი სიტყვებით ახსენით რა მოხდა ამ კოდში

number=10
number=20
print(number)