# 2)კომენტარების სახით ჩამთვალეთ ყველა შედარებითი ოპერატორები და გააკეთეთ 5-5 ნაგალითი თითოეულზე.~

# 1) ==-> ამოწმებს არის თუ არა ორი მნიშვნელობა ერთმანეთის ტოლი
print(5 == 5)   
print(7 == 3)   
print("a" == "a")  
print("abc" == "ABC")  
print(10 == 10.0) 

# # 2)!=-> ამოწმებს არის თუ არა განსხვავებული ორი მნიშვნელობა
print(5 != 3)   
print(4 != 4)   
print("hi" != "hello")  
print("cat" != "Cat")  
print(True != False)  


# # 3) >  -> ამოწმებს არის თუ არა მარცხენა მნიშვნელობა მარჯვნაზე მეტი
print(7 > 3)   
print(2 > 5)   
print(10 > 10) 
print(100 > 99) 
print(-1 > -2)  


# # 4) <  -> ამოწმებს არის თუ არა მარცხენა მნიშვნელობა მარჯვნაზე ნაკლები
print(3 < 5)   
print(10 < 7)  
print(2 < 2)   
print(-5 < 0)  
print(1 < 10)  


# # 5) >=  -> ამოწმებს არის თუ არა მარცხენა მნიშვნელობა მარჯვნაზე მეტი ან ტოლი
print(5 >= 5)   
print(7 >= 3)   
print(2 >= 8)  
print(10 >= 9)  
print(-1 >= -1) 


# # 6) <=  -> ამოწმებს არის თუ არა მარცხენა მნიშვნელობა მარჯვნაზე ნაკლები ან ტოლი
print(4 <= 4)   
print(3 <= 5)   
print(8 <= 2)   
print(10 <= 10) 
print(-3 <= -2) 
#=================================================================================================================================================================
#3)კომენტარების სახით ახსენით რა არის logical operators, ჩამოწერეთ თითოეული და განმარტეთ რომელი რა დროს რა შედეგს გვიბრუნებს.
#4) გააკეთეთ 3-3 მაგალითი logical operator-ებზე.

#Logical operators გამოიყენება მაშინ,
#როცა გვინდა ორი ან მეტი პირობის ერთდროულად შემოწმება.
#ისინი აბრუნებენ მხოლოდ ორ შედეგს: True (სიმართლე) ან False (ცრუ).

# Python-ში ყველაზე ხშირად გამოიყენება ორი ოპერატორი:
# 1) and 
# 2) or   


# and ოპერატორი
# მუშაობს ასე:
# შედეგი იქნება True მხოლოდ მაშინ, როცა ორივე პირობაა True.
# თუ ერთ-ერთი მაინც False იქნება → საბოლოო პასუხი False იქნება.

print(5 > 3 and 10 > 5)   
print(5 > 3 and 10 < 5)   
print(7 == 7 and 2 < 4)   
print(8 < 2 and 4 < 10)   
print(1 == 1 and 2 == 3)  


# #or ოპერატორი
# # მუშაობს ასე:
# # შედეგი იქნება True მაშინაც კი, თუ ერთ-ერთი პირობაა True.
# # მხოლოდ მაშინ იქნება False, როცა ორივე პირობაა False.

print(5 > 3 or 10 < 5)    
print(2 > 3 or 4 > 1)     
print(1 == 1 or 2 == 2)   
print(7 < 5 or 3 < 2)     
print(10 > 9 or 10 < 8)   
#=================================================================================================================================================================
# ვქმნით წინასწარ ერთ რიცხვს, რომელსაც მომხმარებლის რიცხვს შევადარებთ
number = 10   # ჩემი რიცხვი

# მომხმარებელს ვთხოვთ, რომ შეიყვანოს რიცხვი
user_number = int(input("შეიყვანე რიცხვი:"))

# ვადარებთ მომხმარებლის რიცხვს ჩვენს რიცხვს
if user_number > number:
    print("შენი რიცხვი მეტია ჩემს რიცხვზე.")
elif user_number < number:
    print("შენი რიცხვი ნაკლებია ჩემს რიცხვზე.")
else:
    print("ორივე რიცხვი ტოლია!")
#=================================================================================================================================================================

#6)მომხმარებელს შემოატანინეთ სახელი, შეინახეთ იგი ცვლადში და მკაცრად შეამოწმეთ უდრის თუ არა იგი თქვენს სახელს. თან ამიხსენი
# მომხმარებლისგან ვიღებთ სახელს
user_name = input("შეიყვანე შენი სახელი: ")

# ვქმნით წინასწარ ჩვენს სახელს
my_name ="საბა"

# ვადარებთ მომხმარებლის სახელს ჩვენსას (== ნიშნავს ტოლია თუ არა)
if user_name == my_name:
    print("სახელი ზუსტად ემთხვევა ჩემს სახელს.")
else:
    print("სახელი განსხვავებულია.")
#=================================================================================================================================================================
#7)მომხმარებელს შემოატანინეთ თავისი ასაკი, შეინახეთ იგი ცვლადში და შეამოწმეთ მეტია თუ არა იგი 18. ახსენი

# მომხმარებლისგან ვიღებთ ასაკს
age = int(input("შეიყვანე შენი ასაკი: "))

# ვადარებთ ასაკს 18-ს
if age > 18:
    print("შენი ასაკი მეტია 18-ზე.")
elif age == 18:
    print("შენი ასაკი ზუსტად 18 წელია.")
else:
    print("შენი ასაკი ნაკლებია 18-ზე.")