# 1. მოცემულია სია. დაბეჭდე მისი პირველი ელემენტი.
# 2. მოცემულია სია. დაბეჭდე მისი ბოლო ელემენტი.
# 3. მოცემულია სია. დაბეჭდე სიის პირველი სამი ელემენტი slicing-ის გამოყენებით.
# 4. მოცემულია სია. დაბეჭდე სიის ბოლო ორი ელემენტი slicing-ის გამოყენებით.
# 5. მოცემულია სია. დაბეჭდე ყველა ელემენტი, გარდა პირველი და ბოლო ელემენტისა.
# 6. მოცემულია სია. დაბეჭდე სია უკუღმა slicing-ის გამოყენებით.
# 7. მოცემულია სია. დაბეჭდე სიის მეორე ელემენტი.
# 8. მოცემულია სია. დაბეჭდე ყოველი მეორე ელემენტი slicing-ის გამოყენებით.
# 9. მოცემულია სია. დაბეჭდე სიის შუა ელემენტი (ჩათვალე, რომ სიის სიგრძე კენტია).
# 10. მოცემულია სია. დაბეჭდე პირველი ნახევარი სიის slicing-ის გამოყენებით.

lst = [1, 2, 3, 4, 5, 6, 7]

print(lst[0])

print(lst[-1])

print(lst[:3])

print(lst[-2:])

print(lst[1:-1])

print(lst[::-1])

print(lst[1])

print(lst[::2])

print(lst[len(lst)//2])

print(lst[:len(lst)//2])
